<?php

return [
    'failed_authentication' => 'أوراق اعتماد خاطئة! حاول مرة اخرى',
    'unauthorized' => 'غير مصرح',
    'account_created' => 'الحساب اقيم بنجاح',
    'unique_email_validation' => "عنوان البريد الإلكتروني مستخدم من قبل",

    'access' => [
        'users' => [
            'delete_user_confirm' => 'هل أنت متأكد أنك تريد حذف هذا المستخدم بشكل دائم؟ من المرجح أن يكون الخطأ في أي مكان في التطبيق يشير إلى معرف المستخدم. المضي قدما على مسؤوليتك الخاصة. هذا لا يمكن التراجع عنها.',
            'if_confirmed_off' => '(إذا تم التأكيد معطلة)',
            'restore_user_confirm' => 'هل تريد استعادة هذا المستخدم إلى حالته الأصلية؟',
        ],
    ],
    'notification' => [
        'reset_password' => [
            'subject' => 'إعادة تعيين إشعار كلمة المرور',
            'line_1' => 'أنت تتلقى هذا البريد الإلكتروني لأننا تلقينا طلب إعادة تعيين كلمة المرور لحسابك.',
            'line_2' => 'ستنتهي صلاحية رابط إعادة تعيين كلمة المرور هذا في غضون 1 دقيقة.',
            'line_3' => 'إذا لم تطلب إعادة تعيين كلمة المرور ، فلا داعي لاتخاذ أي إجراء آخر.',
        ],
        'verify_email' => [
            'subject' => 'التحقق من عنوان البريد الإلكتروني',
            'line_1' => 'الرجاء النقر فوق الزر أدناه للتحقق من عنوان بريدك الإلكتروني.',
            'line_2' => 'إذا لم تقم بإنشاء حساب ، فلا داعي لاتخاذ أي إجراء آخر.',
        ],
    ],
    'verifies_emails' => [
        'already_verified' => 'تم التحقق من البريد الإلكتروني بالفعل .....',
        'bad_codes' => 'رموز سيئة.',
        'verified_success' => 'تم التحقق من البريد الإلكتروني بنجاح.',
        'resent_success' => 'استاء البريد الإلكتروني بنجاح.',
    ],
    'change_password' => [
        'success' => 'تم تغيير الرقم السري بنجاح.',
        'failed' => 'فشل تغيير كلمة المرور.',
    ],
    'update_account' => [
        'success' => 'تم تحديث الحساب بنجاح.',
        'cannot_send_email_verification' => 'لا يمكن إرسال رسالة التحقق إلى هذا العنوان:',
    ],
    'linked_social' => [
        'find_associated' => 'ابحث عن حساب مستخدم مرتبط بحساب :provider_name هذا',
        'user_created' => 'تم إنشاء حساب مستخدم جديد وحساب اجتماعي.',
        'social_account_created_for_user' => 'تم إنشاء حساب اجتماعي جديد لـ :name',
    ],
];
